# 10. Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21
from math import sqrt


print('Введите координаты точки А:')
x1_A = float(input('X1: '))
y1_A = float(input('Y1: '))
print("Введите координаты точки Б:")
x2_B = float(input('X2: '))
y2_B = float(input('Y2: '))

print('расстояние между точками А и Б равно: ',round(sqrt((x1_A - x2_B)**2 + (y1_A - y2_B)**2), 2))